tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
brew "asdf"
brew "fd"
brew "fzf"
brew "git"
brew "htop"
brew "lsd"
brew "mackup"
brew "neovim"
brew "pipx"
brew "ripgrep"
brew "rm-improved"
brew "ssh-copy-id"
brew "starship"
brew "tealdeer"
brew "tmux"
brew "zoxide"
cask "alacritty"
cask "chromium"
cask "font-caskaydia-cove-nerd-font"
cask "iterm2"
cask "visual-studio-code"
brew "aria2"
brew "asciinema"
brew "atuin"
brew "autocorrect"
brew "awk"
brew "awscli"
brew "azure-cli"
brew "bat"
brew "bazelisk"
brew "bore-cli"
brew "borkdude/brew/babashka"
brew "bottom"
brew "brimdata/tap/zed"
brew "brimdata/tap/zq"
brew "broot"
brew "chafa"
brew "cheat"
brew "choose-rust"
brew "ciphey"
brew "cloudflare/cloudflare/cloudflared"
brew "cmake"
brew "colima"
brew "d12frosted/emacs-plus/emacs-plus@29"
brew "dasel"
brew "deb-sig/tap/double-entry-generator"
brew "difftastic"
brew "direnv"
brew "docker"
brew "dog"
brew "duf"
brew "dust"
brew "exiftool"
brew "extra-cmake-modules"
brew "fcp"
brew "fd"
brew "ffmpeg"
brew "flyctl"
brew "fpp"
brew "frps"
brew "fswatch"
brew "gh"
brew "git"
brew "git-cliff"
brew "git-crypt"
brew "git-extras"
brew "git-lfs"
brew "git-quick-stats"
brew "glow"
brew "gnu-sed"
brew "gnu-tar"
brew "gping"
brew "graphviz"
brew "grep"
brew "grex"
brew "htop"
brew "httpie"
brew "hugo"
brew "hyperfine"
brew "iperf"
brew "ipinfo-cli"
brew "jc"
brew "jq"
brew "juliaup"
brew "just"
brew "latexindent"
brew "lazydocker"
brew "lazygit"
brew "lf"
brew "libmagic"
brew "llvm"
brew "lnav"
brew "lsd"
brew "m-cli"
brew "make"
brew "mas"
brew "media-info"
brew "modularml/packages/modular"
brew "monolith"
brew "navi"
brew "ncdu"
brew "neovide"
brew "nmap"
brew "noborus/tap/ov"
brew "node"
brew "pandoc-crossref"
brew "pdfgrep"
brew "php"
brew "pipx"
brew "platformio"
brew "procs"
brew "pueue"
brew "pyenv"
brew "qt"
brew "ripgrep"
brew "rm-improved"
brew "rust"
brew "sd"
brew "sevenzip"
brew "shellcheck"
brew "sk"
brew "smartmontools"
brew "ssh-copy-id"
brew "starship"
brew "t-rec"
brew "tealdeer"
brew "texinfo"
brew "thefuck"
brew "timothyye/tap/skm"
brew "tmate"
brew "tmux"
brew "tokei"
brew "tor"
brew "tree"
brew "typos-cli"
brew "typst"
brew "ugit"
brew "vips"
brew "watchexec"
brew "wget"
brew "yq"
brew "yt-dlp"
brew "zig"
brew "zola"
brew "zoxide"
brew "zurawiki/brews/gptcommit"
