tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers", "https://mirrors.tuna.tsinghua.edu.cn/git/homebrew/homebrew-cask-drivers.git"
tap "homebrew/cask-fonts", "https://mirrors.tuna.tsinghua.edu.cn/git/homebrew/homebrew-cask-fonts.git"
tap "homebrew/cask-versions", "https://mirrors.tuna.tsinghua.edu.cn/git/homebrew/homebrew-cask-versions.git"
tap "homebrew/command-not-found", "https://mirrors.tuna.tsinghua.edu.cn/git/homebrew/homebrew-command-not-found.git"
tap "homebrew/core"
tap "mongodb/brew"
vscode "1Password.op-vscode"
vscode "alefragnani.project-manager"
vscode "AMiner.codegeex"
vscode "antfu.file-nesting"
vscode "antfu.slidev"
vscode "aster.vscode-subtitles"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bodil.file-browser"
vscode "Catppuccin.catppuccin-vsc"
vscode "CelianRiboulet.webvalidator"
vscode "christian-kohler.path-intellisense"
vscode "codeandstuff.package-json-upgrade"
vscode "codezombiech.gitignore"
vscode "csholmq.excel-to-markdown-table"
vscode "darkriszty.markdown-table-prettify"
vscode "DavidAnson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "dnicolson.binary-plist"
vscode "dongfg.vscode-beancount-formatter"
vscode "donjayamanne.githistory"
vscode "donjayamanne.jquerysnippets"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "EditorConfig.EditorConfig"
vscode "EdwinKofler.vscode-assorted-languages"
vscode "emilast.LogFileHighlighter"
vscode "esbenp.prettier-vscode"
vscode "felipecaputo.git-project-manager"
vscode "figma.figma-vscode-extension"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "foxundermoon.shell-format"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "github.vscode-github-actions"
vscode "GitHub.vscode-pull-request-github"
vscode "GrapeCity.gc-excelviewer"
vscode "Gruntfuggly.todo-tree"
vscode "hediet.vscode-drawio"
vscode "hollowtree.vue-snippets"
vscode "HookyQR.minify"
vscode "huacnlee.autocorrect"
vscode "idleberg.icon-fonts"
vscode "ionutvmi.path-autocomplete"
vscode "jacobdufault.fuzzy-search"
vscode "James-Yu.latex-workshop"
vscode "janisdd.vscode-edit-csv"
vscode "julialang.language-julia"
vscode "kahole.magit"
vscode "KevinRose.vsc-python-indent"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "lehoanganh298.json-lines-viewer"
vscode "Lencerf.beancount"
vscode "lmql-team.lmql"
vscode "marp-team.marp-vscode"
vscode "mathiassoeholm.markdown-link-updater"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "miguelsolorio.fluent-icons"
vscode "mkxml.vscode-filesize"
vscode "modular-mojotools.vscode-mojo"
vscode "morph.rift-vscode"
vscode "ms-azuretools.vscode-docker"
vscode "MS-CEINTL.vscode-language-pack-zh-hans"
vscode "ms-python.autopep8"
vscode "ms-python.black-formatter"
vscode "ms-python.flake8"
vscode "ms-python.isort"
vscode "ms-python.mypy-type-checker"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.live-server"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "mushan.vscode-paste-image"
vscode "naumovs.color-highlight"
vscode "ninoseki.vscode-pylens"
vscode "njpwerner.autodocstring"
vscode "nvarner.typst-lsp"
vscode "octref.vetur"
vscode "oderwat.indent-rainbow"
vscode "oysun.vuehelper"
vscode "PKief.material-icon-theme"
vscode "platformio.platformio-ide"
vscode "pomdtr.excalidraw-editor"
vscode "pranaygp.vscode-css-peek"
vscode "qezhu.gitlink"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "REditorSupport.r"
vscode "Rickaym.manim-sideview"
vscode "rust-lang.rust-analyzer"
vscode "sdras.vue-vscode-snippets"
vscode "serayuzgur.crates"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "sidthesloth.html5-boilerplate"
vscode "skn0tt.markdown-link-expander"
vscode "streetsidesoftware.code-spell-checker"
vscode "sysoev.language-stylus"
vscode "tamasfe.even-better-toml"
vscode "techer.open-in-browser"
vscode "tecosaur.latex-utilities"
vscode "telesoho.vscode-markdown-paste-image"
vscode "timonwong.shellcheck"
vscode "Tyriar.sort-lines"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "vintharas.learn-vim"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "VSpaceCode.vspacecode"
vscode "VSpaceCode.whichkey"
vscode "WallabyJs.quokka-vscode"
vscode "wayou.vscode-todo-highlight"
vscode "xabikos.JavaScriptSnippets"
vscode "xlthu.Pangu-Markdown"
vscode "xyz.local-history"
vscode "yy0931.save-as-root"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
