alefragnani.project-manager
AMiner.codegeex
antfu.file-nesting
antfu.slidev
aster.vscode-subtitles
bierner.markdown-mermaid
bierner.markdown-preview-github-styles
bodil.file-browser
Catppuccin.catppuccin-vsc
CelianRiboulet.webvalidator
christian-kohler.path-intellisense
codeandstuff.package-json-upgrade
codezombiech.gitignore
csholmq.excel-to-markdown-table
darkriszty.markdown-table-prettify
DavidAnson.vscode-markdownlint
dbaeumer.vscode-eslint
dnicolson.binary-plist
dongfg.vscode-beancount-formatter
donjayamanne.githistory
donjayamanne.jquerysnippets
eamodio.gitlens
ecmel.vscode-html-css
EditorConfig.EditorConfig
EdwinKofler.vscode-assorted-languages
emilast.LogFileHighlighter
esbenp.prettier-vscode
felipecaputo.git-project-manager
figma.figma-vscode-extension
formulahendry.auto-close-tag
formulahendry.auto-rename-tag
formulahendry.code-runner
foxundermoon.shell-format
GitHub.copilot
GitHub.copilot-chat
github.vscode-github-actions
GitHub.vscode-pull-request-github
GrapeCity.gc-excelviewer
Gruntfuggly.todo-tree
hediet.vscode-drawio
hollowtree.vue-snippets
HookyQR.minify
huacnlee.autocorrect
idleberg.icon-fonts
ionutvmi.path-autocomplete
jacobdufault.fuzzy-search
James-Yu.latex-workshop
janisdd.vscode-edit-csv
jithurjacob.nbpreviewer
julialang.language-julia
kahole.magit
KevinRose.vsc-python-indent
kisstkondoros.vscode-gutter-preview
lehoanganh298.json-lines-viewer
Lencerf.beancount
lmql-team.lmql
marp-team.marp-vscode
mathiassoeholm.markdown-link-updater
mechatroner.rainbow-csv
mhutchie.git-graph
miguelsolorio.fluent-icons
mkxml.vscode-filesize
modular-mojotools.vscode-mojo
morph.rift-vscode
ms-azuretools.vscode-docker
MS-CEINTL.vscode-language-pack-zh-hans
ms-dotnettools.dotnet-interactive-vscode
ms-python.autopep8
ms-python.black-formatter
ms-python.flake8
ms-python.isort
ms-python.mypy-type-checker
ms-python.pylint
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-powertoys
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode.cpptools
ms-vscode.live-server
ms-vscode.powershell
ms-vscode.remote-explorer
mushan.vscode-paste-image
naumovs.color-highlight
ninoseki.vscode-pylens
njpwerner.autodocstring
nvarner.typst-lsp
octref.vetur
oderwat.indent-rainbow
oysun.vuehelper
pamaron.pytest-runner
PKief.material-icon-theme
platformio.platformio-ide
pomdtr.excalidraw-editor
pranaygp.vscode-css-peek
qezhu.gitlink
redhat.vscode-xml
redhat.vscode-yaml
REditorSupport.r
Rickaym.manim-sideview
rust-lang.rust-analyzer
sdras.vue-vscode-snippets
serayuzgur.crates
shd101wyy.markdown-preview-enhanced
sidthesloth.html5-boilerplate
skn0tt.markdown-link-expander
streetsidesoftware.code-spell-checker
sysoev.language-stylus
tamasfe.even-better-toml
techer.open-in-browser
tecosaur.latex-utilities
telesoho.vscode-markdown-paste-image
timonwong.shellcheck
Tyriar.sort-lines
unifiedjs.vscode-mdx
usernamehw.errorlens
vintharas.learn-vim
VisualStudioExptTeam.intellicode-api-usage-examples
vscode-icons-team.vscode-icons
vscodevim.vim
VSpaceCode.vspacecode
VSpaceCode.whichkey
WallabyJs.quokka-vscode
wayou.vscode-todo-highlight
xabikos.JavaScriptSnippets
xelad0m.jupyter-toc
xlthu.Pangu-Markdown
xyz.local-history
yy0931.save-as-root
yzhang.markdown-all-in-one
zhuangtongfa.material-theme
